"""
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку 
здійснюється за механізмом 
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення, 
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""
students = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}

students['Павло Тичина'] = {
    'Пошта': 'pasha@gmail.com',
    'Вік': 25,
    'Номер телефону': '+380984671221',
    'Середній бал': 90
}

hasht = '#' * 80
print(hasht)

all_points = 0
for student_name in students:
    all_points += students[student_name]['Середній бал']
    if students[student_name]['Номер телефону'] is None:
        students[student_name]['Номер телефону'] = input(f"Номер телефону {student_name} відсутній. Введіть номер його/її батьків:")
        print(hasht)
    if students[student_name]['Середній бал'] >= 90:
        print(f"Ім'я: {student_name}, Середній бал: {students[student_name]['Середній бал']}")
        print(hasht)

if len(students) != 0:
    avg_point = all_points / len(students)
    print(f"Середній бал по групі: {avg_point}")
